## Search PK in NameBasics

In [35]:
%%bigquery
SELECT COUNT(*) FROM imdb_staging.NameBasics

        f0_
0  19741382

In [36]:
%%bigquery
SELECT COUNT(DISTINCT string_field_0) FROM imdb_staging.NameBasics

       f0_
0  9870691

In [37]:
%%bigquery
SELECT COUNT(DISTINCT string_field_1) FROM imdb_staging.NameBasics

       f0_
0  7738984

In [38]:
%%bigquery
SELECT COUNT(DISTINCT string_field_2) FROM imdb_staging.NameBasics

   f0_
0  481

In [39]:
%%bigquery
SELECT COUNT(DISTINCT string_field_3) FROM imdb_staging.NameBasics

   f0_
0  425

In [40]:
%%bigquery
SELECT COUNT(DISTINCT string_field_4) FROM imdb_staging.NameBasics

     f0_
0  19769

In [41]:
%%bigquery
SELECT COUNT(DISTINCT string_field_5) FROM imdb_staging.NameBasics

       f0_
0  4104044

## No PK in NameBasics

## Search PK in TitleBasics

In [42]:
%%bigquery
SELECT COUNT(*) FROM imdb_staging.TitleBasics

        f0_
0  13048186

In [43]:
%%bigquery
SELECT COUNT(DISTINCT tconst) FROM imdb_staging.TitleBasics

       f0_
0  6524093

In [44]:
%%bigquery
SELECT COUNT(DISTINCT titleType) FROM imdb_staging.TitleBasics

   f0_
0   10

In [45]:
%%bigquery
SELECT COUNT(DISTINCT primaryTitle) FROM imdb_staging.TitleBasics

       f0_
0  3248032

In [46]:
%%bigquery
SELECT COUNT(DISTINCT originalTitle) FROM imdb_staging.TitleBasics

       f0_
0  3264192

In [47]:
%%bigquery
SELECT COUNT(DISTINCT isAdult) FROM imdb_staging.TitleBasics

   f0_
0   11

In [48]:
%%bigquery
SELECT COUNT(DISTINCT startYear) FROM imdb_staging.TitleBasics

   f0_
0  147

In [49]:
%%bigquery
SELECT COUNT(DISTINCT endYear) FROM imdb_staging.TitleBasics

   f0_
0   93

In [50]:
%%bigquery
SELECT COUNT(DISTINCT runtimeMinutes) FROM imdb_staging.TitleBasics

   f0_
0  820

In [51]:
%%bigquery
SELECT COUNT(DISTINCT genres) FROM imdb_staging.TitleBasics

    f0_
0  2242

## NO PK in TitleBasics

## Search PK in TitleCrew

In [52]:
%%bigquery
SELECT COUNT(*) FROM imdb_staging.TitleCrew

        f0_
0  13048186

In [53]:
%%bigquery
SELECT COUNT(DISTINCT string_field_0) FROM imdb_staging.TitleCrew

       f0_
0  6524093

In [54]:
%%bigquery
SELECT COUNT(DISTINCT string_field_1) FROM imdb_staging.TitleCrew

      f0_
0  716886

In [55]:
%%bigquery
SELECT COUNT(DISTINCT string_field_2) FROM imdb_staging.TitleCrew

      f0_
0  998535

## No PK in TitleCrew

## Search PK in TitlePrincipals

In [56]:
%%bigquery
SELECT COUNT(*) FROM imdb_staging.TitlePrincipals

        f0_
0  75428948

In [57]:
%%bigquery
SELECT COUNT(DISTINCT tconst) FROM imdb_staging.TitlePrincipals

       f0_
0  5899530

In [58]:
%%bigquery
SELECT COUNT(DISTINCT ordering) FROM imdb_staging.TitlePrincipals

   f0_
0   10

In [59]:
%%bigquery
SELECT COUNT(DISTINCT nconst) FROM imdb_staging.TitlePrincipals

       f0_
0  3940866

In [60]:
%%bigquery
SELECT COUNT(DISTINCT category) FROM imdb_staging.TitlePrincipals

   f0_
0   12

In [61]:
%%bigquery
SELECT COUNT(DISTINCT job) FROM imdb_staging.TitlePrincipals

     f0_
0  32480

In [62]:
%%bigquery
SELECT COUNT(DISTINCT characters) FROM imdb_staging.TitlePrincipals

       f0_
0  2238979

## No PK in TitlePrincipals

## Search PK in TitleRatings

In [63]:
%%bigquery
SELECT COUNT(*) FROM imdb_staging.TitleRatings

       f0_
0  2044302

In [64]:
%%bigquery
SELECT COUNT(DISTINCT tconst) FROM imdb_staging.TitleRatings

       f0_
0  1022151

In [65]:
%%bigquery
SELECT COUNT(DISTINCT averageRating) FROM imdb_staging.TitleRatings

   f0_
0   91

In [66]:
%%bigquery
SELECT COUNT(DISTINCT numVotes) FROM imdb_staging.TitleRatings

     f0_
0  17614

## No PK in TitleRatings